#############################################################################
##
#W  grpsmat.xml
#Y  Copyright (C) 2015                                    Markus Pfeiffer
##
##  Licensing information can be found in the README file of this package.
##
#############################################################################
##

<#GAPDoc Label="MatrixGroupOperation">
<ManSection>
  <Oper Name="\^" Arg="G, mat" Label="for an matrix over finite field group and matrix over finite field"/>
  <Returns>A matrix group over a finite field</Returns>
  <Description>
    Conjugates the matrix group <A>G</A> inside the group <M>GL_n(F)</M> by
    the matrix <A>mat</A>.
    <Example><![CDATA[
gap> x := NewMatrixOverFiniteField(IsPlistMatrixOverFiniteFieldRep, GF(4), 3,
> Z(4)^0*[[1,1,0], [0,1,0], [1,1,1]] );;
gap> y := NewMatrixOverFiniteField(IsPlistMatrixOverFiniteFieldRep, GF(4), 3,
> Z(4)^0*[[1,0,0], [1,0,1], [1,1,1]] );;
gap> G := Group(x);
<group of 3x3 matrices over GF(2^2) with 1 generator>
gap> G ^ y;
<group of 3x3 matrices over GF(2^2) with 1 generator>
]]></Example>
  </Description>
</ManSection>
<#/GAPDoc>

<#GAPDoc Label="IsomorphismMatrixGroup">
<ManSection>
  <Attr Name="IsomorphismMatrixGroup" Arg="G"/>
  <Returns>An isomorphism.</Returns>
  <Description>
    Returns an isomorphism from <A>G</A> into a &GAP; group.
    <Example><![CDATA[
gap> x := NewMatrixOverFiniteField(IsPlistMatrixOverFiniteFieldRep, GF(4), 3,
> Z(4)^0*[[1,1,0], [0,1,0], [1,1,1]] );;
gap> G := Group(x);;
gap> iso := IsomorphismMatrixGroup(G);;
gap> Source(iso); Range(iso);
<group of 3x3 matrices over GF(2^2) with 1 generator>
Group(
[
  [ [ Z(2)^0, Z(2)^0, 0*Z(2) ], [ 0*Z(2), Z(2)^0, 0*Z(2) ],
      [ Z(2)^0, Z(2)^0, Z(2)^0 ] ] ])

 ]]></Example>
  </Description>
</ManSection>
<#/GAPDoc>

<#GAPDoc Label="AsMatrixGroup">
<ManSection>
  <Attr Name="AsMatrixGroup" Arg="G"/>
  <Returns>A &GAP; group.</Returns>
  <Description>
    Returns the image of an isomorphism returned by <Ref Label="IsomorphismMatrixGroup"/>.
    <Example><![CDATA[
gap> x := NewMatrixOverFiniteField(IsPlistMatrixOverFiniteFieldRep, GF(4), 3,
> Z(4)^0*[[1,1,0], [0,1,0], [1,1,1]] );;
gap> G := Group(x);;
gap> AsMatrixGroup(G);
Group(
[ 
  [ [ Z(2)^0, Z(2)^0, 0*Z(2) ], [ 0*Z(2), Z(2)^0, 0*Z(2) ], 
      [ Z(2)^0, Z(2)^0, Z(2)^0 ] ] ])
 ]]></Example>
  </Description>
</ManSection>
<#/GAPDoc>
