#############################################################################
##
#W  semimat.xml
#Y  Copyright (C) 2014                                    Markus Pfeiffer
##
##  Licensing information can be found in the README file of this package.
##
#############################################################################
##

<#GAPDoc Label="MatrixSemigroup">
<ManSection>
  <Func Name="MatrixSemigroup" Arg=""/>
  <Returns>A matrix semigroup.</Returns>
  <Description>
    This is the kitchen-sink matrix semigroup creation function. It is designed
    to make it easy to create matrix semigroups without having to go through
    creating matrix objects first.
    <Example><![CDATA[
gap> S := MatrixSemigroup(Z(4) * [[1,0,0], [1,1,0], [0,1,0]],
>                         Z(4) * [[0,0,0],[0,0,1],[0,1,0]]);
<semigroup of 3x3 s-matrices over GF(2^2) with 2 generators>]]></Example>
    <M>S</M> is now a semigroup object for all intents and purposes of
    &Semigroups;.
   To help <Ref Func="MatrixSemigroup"/> along with creating the semigroup
   you can give it optional arguments to specify the field that the matrices
   are supposed to have entries in and the dimension of the matrix.

   <Example><![CDATA[
gap> S := MatrixSemigroup([Z(4) * [[1,0,0], [1,1,0], [0,1,0]],
>                          Z(4) * [[0,0,0], [0,0,1], [0,1,0]]], GF(4));
<semigroup of 3x3 s-matrices over GF(2^2) with 2 generators>]]></Example>
  Note that for this usage the generators have to be given as a list as
  the first argument to <Ref Func="MatrixSemigroup"/>.
  </Description>
</ManSection>
<#/GAPDoc>

<#GAPDoc Label="IsomorphismMatrixSemigroup">
<ManSection>
  <Oper Name="IsomorphismMatrixSemigroup" Arg="S[, F]"/>
  <Returns>An isomorphism to a matrix semigroup.</Returns>
  <Description>
    This attribute contains an isomorphism from the semigroup <A>S</A>
    to a matrix semigroup. Currently this is done by taking a standard basis
    of a vector space suitable dimension and acting on this basis over the field
    <A>F</A> if <A>F</A> is given, and over <M>GF(2)</M> if <A>F</A> is not given.
    This will
    not give an optimal matrix semigroup representation of <A>S</A>.
  <Example><![CDATA[
gap> T := Semigroup(Transformation([2,2,3]), Transformation([3,1,3]));
<transformation semigroup on 3 pts with 2 generators>
gap> iso := IsomorphismMatrixSemigroup(T);
MappingByFunction( <transformation semigroup 
 on 3 pts with 2 generators>, <semigroup of 3x3 s-matrices over GF(2)
 with 2 generators>, function( x ) ... end, function( x ) ... end )
gap> Size(Range(iso));
5]]></Example>
  </Description>
</ManSection>
<#/GAPDoc>

<#GAPDoc Label="AsMatrixSemigroup">
<ManSection>
  <Oper Name="AsMatrixSemigroup" Arg="S[, F]" Label="for a semigroup and a ring"/>
  <Returns>The range of an isomorphism to a matrix semigroup.</Returns>
  <Description>
  <Example><![CDATA[
gap> T := Semigroup(Transformation([2,2,3]), Transformation([3,1,3]));
<transformation semigroup on 3 pts with 2 generators>
gap> S := AsMatrixSemigroup(T);
<semigroup of 3x3 s-matrices over GF(2) with 2 generators>
gap> Size(S);
5
]]></Example>
  </Description>
</ManSection>
<#/GAPDoc>

<#GAPDoc Label="IsMatrixSemigroupGreensClass">
  <ManSection>
    <Prop Name="IsMatrixSemigroupGreensClass" Arg="class"/>
    <Returns><K>true</K> or <K>false</K>.</Returns>
    <Description>
      A Green's class <A>class</A> of a semigroup <C>S</C> satisfies the
      property <C>IsMatrixSemigroupGreensClass</C> if and only if <C>S</C>
      is a semigroup of matrices.
    </Description>
  </ManSection>
<#/GAPDoc>
